In [1]:
# Calling the necessary libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### 1- Business Problem

A gaming company wants to use some of the characteristics of its customers to create level-based new customer definitions and, based on these new customer definitions, estimate how much new customers can earn the company on average.

### 2- Dataset Story

The dataset contains the prices of products sold by an international gaming company and some demographic information of the users who purchased these products. The dataset consists of records for each sales transaction. This means that the table is not deduplicated. In other words, a user with demographic characteristics may have made more than one purchase.

### 3- Features

+ PRICE - The amount of money spent by the customer.
+ SOURCE - The type of device used by the customer.
+ SEX - The gender of the customer.
+ COUNTRY - The country of the customer.
+ AGE - The age of the customer

### 4- Tasks

#### 4.1 General information about the data set

In [2]:
# Load the dataset
df = pd.read_csv("datasets/persona.csv")

In [3]:
df.head()

   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17

In [4]:
# View information about the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB

In [5]:
# View basic statistics about the dataset
df.describe()

             PRICE          AGE
count  5000.000000  5000.000000
mean     34.132000    23.581400
std      12.464897     8.995908
min       9.000000    15.000000
25%      29.000000    17.000000
50%      39.000000    21.000000
75%      39.000000    27.000000
max      59.000000    66.000000

In [6]:
# Identify columns with null values
df.isnull().any()

PRICE      False
SOURCE     False
SEX        False
COUNTRY    False
AGE        False
dtype: bool

In [7]:
# How many uniques are there for the SOURCE variable and what are their frequencies?
df["SOURCE"].nunique()

2

In [8]:
df["SOURCE"].unique()

array(['android', 'ios'], dtype=object)

In [9]:
df["SOURCE"].value_counts()

SOURCE
android    2974
ios        2026
Name: count, dtype: int64

In [10]:
# How many uniques are there for the PRICE variable and what are their frequencies?
df["PRICE"].nunique()

6

In [11]:
df["PRICE"].unique()

array([39, 49, 29, 19, 59,  9], dtype=int64)

In [12]:
df["PRICE"].value_counts()

PRICE
29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: count, dtype: int64

In [13]:
# How many units were sold in which countries?
df["COUNTRY"].value_counts()

COUNTRY
usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: count, dtype: int64

In [14]:
df.groupby("COUNTRY").agg({"PRICE": "count"})

         PRICE
COUNTRY
bra       1496
can        230
deu        455
fra        303
tur        451
usa       2065

In [15]:
# How much was earned from sales in total by country?
df.groupby("COUNTRY").agg({"PRICE":"sum"})

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

In [16]:
# What are the sales numbers by SOURCE types?
df["SOURCE"].value_counts()

SOURCE
android    2974
ios        2026
Name: count, dtype: int64

In [17]:
# What are the PRICE averages by country?
df.groupby("COUNTRY").agg({"PRICE":"mean"})

             PRICE
COUNTRY
bra      34.327540
can      33.608696
deu      34.032967
fra      33.587459
tur      34.787140
usa      34.007264

In [18]:
# What are the PRICE averages according to SOURCEs?
df.groupby("SOURCE").agg({"PRICE": "mean"})

             PRICE
SOURCE
android  34.174849
ios      34.069102

In [19]:
# What are the PRICE averages in the COUNTRY-RESOURCE breakdown?
df.groupby(["COUNTRY", "SOURCE"]).agg({"PRICE": "mean"})

                     PRICE
COUNTRY SOURCE
bra     android  34.387029
        ios      34.222222
can     android  33.330709
        ios      33.951456
deu     android  33.869888
        ios      34.268817
fra     android  34.312500
        ios      32.776224
tur     android  36.229437
        ios      33.272727
usa     android  33.760357
        ios      34.371703

#### 4.2 Average earnings by Country, Source, Gender and Age distribution

In [20]:
df.groupby(["COUNTRY", "SOURCE", "SEX", "AGE"]).agg({"PRICE": "mean"})

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897
...                               ...
usa     ios     male   42   30.250000
                       50   39.000000
                       53   34.000000
                       55   29.000000
                       59   46.500000

[348 rows x 1 columns]

#### 4.3 Sort the output by PRICE. In the previous question, apply the sort_values method descending by PRICE to get a better view of the output. Save the output as ag_df.

In [21]:
agg_df = df.groupby(["COUNTRY", "SEX", "SOURCE", "AGE"]). agg({"PRICE": "mean"}).sort_values("PRICE", ascending=False)

In [22]:
agg_df

                            PRICE
COUNTRY SEX    SOURCE  AGE
bra     male   android 46    59.0
fra     female android 24    59.0
usa     male   android 36    59.0
               ios     32    54.0
        female android 47    49.0
...                           ...
               ios     38    19.0
bra     male   ios     47    19.0
can     female android 27    19.0
bra     female ios     34    19.0
deu     male   android 26     9.0

[348 rows x 1 columns]

#### 4.4 Convert the names in the index to variable names. All variables except PRICE in the output of the third question are index names. Convert these names to variable names.

In [23]:
agg_df = agg_df.reset_index()

In [24]:
agg_df.head()

  COUNTRY     SEX   SOURCE  AGE  PRICE
0     bra    male  android   46   59.0
1     fra  female  android   24   59.0
2     usa    male  android   36   59.0
3     usa    male      ios   32   54.0
4     usa  female  android   47   49.0

#### 4.5 Convert the age variable to a categorical variable and add it to agg_df. Create intervals convincingly. For example: '0_18', '19_23', '24_30', '31_40', '41_70'

In [25]:
agg_df["AGE_CAT"] = pd.cut(agg_df["AGE"], [0,18,23,30,40,70],
                           labels=["0_18", "19_23", "24_30", "31_40", "41_" + str(agg_df["AGE"].max())])

In [26]:
agg_df["AGE_CAT"].head()

0    41_66
1    24_30
2    31_40
3    31_40
4    41_66
Name: AGE_CAT, dtype: category
Categories (5, object): ['0_18' < '19_23' < '24_30' < '31_40' < '41_66']

In [27]:
agg_df["AGE_CAT"].value_counts()

AGE_CAT
24_30    78
0_18     77
19_23    71
31_40    65
41_66    57
Name: count, dtype: int64

In [28]:
agg_df.head()

  COUNTRY     SEX   SOURCE  AGE  PRICE AGE_CAT
0     bra    male  android   46   59.0   41_66
1     fra  female  android   24   59.0   24_30
2     usa    male  android   36   59.0   31_40
3     usa    male      ios   32   54.0   31_40
4     usa  female  android   47   49.0   41_66

#### 4.6 Define new level-based customers (personas) and add them to the data set as variables. The name of the new variable to be added is: customer_level_based. You need to create the customer_level_base variable by combining your observations in the output you will obtain in the previous question. Attention! Once customer_level based values are created with list comprehension, these values need to be deduplicated. There may be more than one of these, for example: USA_ANDROID_MALE_0_18. It is necessary to take them to groupby and get the price average.

In [29]:
agg_df["customers_level_based"] = [col[0].upper() + "_" + col[1].upper() + "_" + col[2].upper() + "_" + col[5].upper() for col in agg_df.values]
agg_df.head()

  COUNTRY     SEX   SOURCE  AGE  PRICE AGE_CAT     customers_level_based
0     bra    male  android   46   59.0   41_66    BRA_MALE_ANDROID_41_66
1     fra  female  android   24   59.0   24_30  FRA_FEMALE_ANDROID_24_30
2     usa    male  android   36   59.0   31_40    USA_MALE_ANDROID_31_40
3     usa    male      ios   32   54.0   31_40        USA_MALE_IOS_31_40
4     usa  female  android   47   49.0   41_66  USA_FEMALE_ANDROID_41_66

In [30]:
agg_df = agg_df[["customers_level_based", "PRICE"]]
agg_df["customers_level_based"].value_counts()

customers_level_based
USA_FEMALE_IOS_24_30        7
USA_MALE_ANDROID_24_30      7
BRA_MALE_ANDROID_24_30      7
BRA_FEMALE_ANDROID_24_30    7
USA_MALE_ANDROID_41_66      7
                           ..
FRA_FEMALE_ANDROID_31_40    1
CAN_FEMALE_ANDROID_41_66    1
TUR_FEMALE_IOS_41_66        1
TUR_MALE_IOS_31_40          1
CAN_FEMALE_ANDROID_24_30    1
Name: count, Length: 109, dtype: int64

In [31]:
agg_df = agg_df.groupby("customers_level_based").agg({"PRICE": "mean"}).reset_index()

In [32]:
agg_df.head()

      customers_level_based      PRICE
0   BRA_FEMALE_ANDROID_0_18  35.645303
1  BRA_FEMALE_ANDROID_19_23  34.077340
2  BRA_FEMALE_ANDROID_24_30  33.863946
3  BRA_FEMALE_ANDROID_31_40  34.898326
4  BRA_FEMALE_ANDROID_41_66  36.737179

#### 4.7 Divide new customers (personas) into segments. Example: USA_ANDROID_MALE_0_18) Divide into 4 segments according to PRICE. Add the segments to agg_df as variables with the SEGMENT naming. Describe the segments (Group by according to the segments and get the price mean, max, sum).

In [33]:
agg_df["SEGMENT"] = pd.qcut(agg_df["PRICE"], 4, labels=["D", "C", "B", "A"])

In [34]:
agg_df.groupby("SEGMENT").agg({"PRICE": ["mean", "sum", "max"]}).reset_index()

  SEGMENT      PRICE
                mean          sum        max
0       D  29.206780   817.789833  32.333333
1       C  33.509674   904.761209  34.077340
2       B  34.999645   944.990411  36.000000
3       A  38.691234  1044.663328  45.428571

In [35]:
agg_df.head()

      customers_level_based      PRICE SEGMENT
0   BRA_FEMALE_ANDROID_0_18  35.645303       B
1  BRA_FEMALE_ANDROID_19_23  34.077340       C
2  BRA_FEMALE_ANDROID_24_30  33.863946       C
3  BRA_FEMALE_ANDROID_31_40  34.898326       B
4  BRA_FEMALE_ANDROID_41_66  36.737179       A

#### 4.8 To which segment does a 33-year-old ANDROID user Turkish woman belong and how much income is she expected to earn on average?

In [36]:
new_user = "TUR_ANDROID_FEMALE_31_40"

In [37]:
agg_df[agg_df["customers_level_based"] == new_user]

Empty DataFrame
Columns: [customers_level_based, PRICE, SEGMENT]
Index: []

In [38]:
agg_df[agg_df["customers_level_based"] == new_user]

Empty DataFrame
Columns: [customers_level_based, PRICE, SEGMENT]
Index: []

In [39]:
##   customers_level_based         PRICE         SEGMENT
## 72 TUR_ANDROID_FEMALE_31_40   41.833333       A

In [40]:
# In which segment and how much income on average is a 35-year-old French woman using IOS expected to earn?
new_user = "FRA_IOS_FEMALE_31_40"

In [41]:
agg_df[agg_df["customers_level_based"] == new_user]

Empty DataFrame
Columns: [customers_level_based, PRICE, SEGMENT]
Index: []

In [42]:
 ##  customers_level_based      PRICE       SEGMENT
 ##   63  FRA_IOS_FEMALE_31_40  32.818182     C